{
  "academic_study_hall": "Academic Study Hall Schedule & Guidelines\n● Office of Academic Affairs Re: Academic Study Hall (ASH) -\nProbation. A student on Academic Probation is in danger of failing a subject for\nstudents are required to Academic Study Hall (ASH) and will be placed into 2\ngroups based on their Academic Probation. • Red group – students who have\nfailed 1-2 subjects and therefore only need to attend ASH each Tuesday &\nmore subjects and therefore need to attend ASH each Tues & Thurs as well as\nASH session The upcoming schedule for Tues & Thurs ASH this year will be: Date\nThursday 3pm-4pm LHN The upcoming schedule for Saturday ASH this year will\n930-1130am Commons During Academic Study Hall, a student will either: • Work\nDuring each Academic Study Hall (ASH), each student needs to: • be in school\nassignments A student can be removed from the Academic Study Hall (ASH) list, •\nStudy Hall: • Please note that failure to report to ASH will result in further\nSaturday detention. • Students are only excused from ASH with prior approval by\nGuidelines and schedule for Academic Study Hall (ASH). Students who have a course\nfailure for Semester 1 were assigned to ASH for semester 2.\n-ASH is scheduled each Tues & Thurs from 3-4pm in LHN. Students must be in dress\ncode for ASH.\n-Certain students with multiple failures were also assigned to Saturday ASH.\nPlease check the schedule so not to miss ASH.\nWe will NOT hold ASH on thursday, 2/20.\nacademic study hall to compensate for missed instructional time. The Academic\nStudy Hall (ASH) takes place both scheduled after-school sessions and on\nAcademic Study Hall - Guidelines & Schedule\n● Office of Academic Affairs Re: Academic Study Hall (ASH) - Notification/Expectations\nthe semester which places you on Academic Probation. A student on Academic\nProbation is in danger of failing a subject for the year and therefore would be\nHall (ASH) and will be placed into 2 groups based on their Academic Probation. •\nASH each Tuesday & Thursday per the schedule below • Gold Group – students who\nhave failed 3 or more subjects and therefore need to attend ASH each Tues & Thurs\nat each ASH session The upcoming schedule for Tues & Thurs ASH this year will be:\n3/27 Thursday 3pm-4pm LHN The upcoming schedule for Saturday ASH this year\n930-1130am Commons During Academic Study Hall, a student will either: • Work on\nAcademic Study Hall (ASH), each student needs to: • be in school dress code • bring\ncan be removed from the Academic Study Hall (ASH) list, • If a student has a passing\n(March 28) Absence or Tardy Policy for Academic Study Hall: • Please note that\nfailure to report to ASH will result in further consequences including disciplinary\nexcused from ASH with prior approval by the Office of Academic Affairs. Email\nPdf download outline the procedures and dates for Academic Study Hall (ASH). ASH will\nin-person Academic Study Hall by OAA on the day we return to in-person learning. •",
  "bus_info": "Page 45-49 Business\nSocial Studies/ Business • 483 Accounting • 479 Personal Finance (0.5 credit) • 488\nIntegrated Marketing Communications (0.5 credit) • 481 Business Management\nLanguage if needed. o should choose an elective from Math, Science, Business or\nBiomedical Science Social Studies/ Business • 470 AP Psychology • 445 AP\nCommunications (0.5 credit) • 481 Business Management Leadership Institute •\ntechnology, war, sex, business, and the environment. 32 33 MATHEMATICS\npreparation for college statistics courses typically required in business, social and\nthe syllabus of the Advanced Placement Program of the College Entrance\nrequired by colleges for majors in social sciences, health sciences and business. It\nBUSINESS The Business Program is designed to give upper class students the\nopportunity to explore a variety of business topics. Using a hands-on learning\nRecommendation required 481 - Principles of Business Management (College Prep\nB) Grades 11, 12 This course introduces business as a vital part of our society\nthrough discussions of both the external environment of business and the internal\nmanagement of the business enterprise. Each student will come to understand the\neconomic, political, and social framework within which a business enterprise must\ntaken for keeping personal records, for understanding the language of business,\nand for orientation to advanced study in business administration. The student will\nlearn to understand business transactions, prepare source documents, maintain\nentries, close accounts and prepare final reports on the condition of the business\nthe effects of stress, chemical substance use and abuse, and good\nEngineering • 272 Engineering II Social Studies/ Business • 483 Accounting • 479\ncredit) • 481 Business Managemen t Leadership Institute • 477 Leadership I (0.5\nshould choose an elective from Math, Science, Business or Psychology\nBiomedical Science Social Studies/ Business • 470 AP Psychology • 445 AP\nCommunications (0.5 credit) • 481 Business Managemen t Leadership Institute •\nBusiness………………………….......................………………………..........................P\n272 Engineering II Social Studies/ Business 483 Accounting 479 Personal Finance\n(0.5 credit) 488 Integrated Marketing Communications (0.5 credit) 481 Business\nelective from Math, Science, Business or Psychology departments. Students of the\nBusiness 470 AP Psychology 445 AP Government 455 AP European History 465\n488 Integrated Marketing Communications (0.5 credit) 481 Business Management\nwar, sex, business, and the environment. No Recommendation required 32\ncourses typically required in business, social and natural science, and health\nStatistics Grade 11, 12 The course of study follows the syllabus of the Advanced\nsocial sciences, health sciences and business. It is an effective preparation for the\nand Department approval. 46 BUSINESS The Business Program is designed to give\nupper class students the opportunity to explore a variety of business topics. Using a\nPrinciples of Business Management (College Prep B) Grades 11, 12 This course",
  "schedule_info": "Academic Study Hall Schedule & Guidelines\nThursday per the schedule below • Gold Group – students who have failed 3 or\nevery other Saturday per the schedule below o Attendance will be recorded at each\nASH session The upcoming schedule for Tues & Thurs ASH this year will be: Date\nThursday 3pm-4pm LHN The upcoming schedule for Saturday ASH this year will\nGuidelines and schedule for Academic Study Hall (ASH). Students who have a course\n-ASH is scheduled each Tues & Thurs from 3-4pm in LHN. Students must be in dress\nPlease check the schedule so not to miss ASH.\nStudy Hall (ASH) takes place both scheduled after-school sessions and on\nscheduled Saturdays. Additionally, a student may need to attend summer school,\nscheduled Progress Reports offer a snapshot of a student’s academic\ntake their semester exams on the scheduled day unless illness prevents them from\nscheduled classes, La Salle students have an additional class added to their\nschedule in which they meet individually with their Learning Specialists. The class\nSalle students will have adjustments in their individual schedules to properly\nschedule a full course schedule. ACADEMIC SKILLS PROGRAM (ASP): The\nyear. If a student is in ASP as a junior or senior, the flexibility in his schedule does\nthe OAA and should be scheduled to present the smallest interruption to the\nscheduled. The teacher of the course may issue alternative work for students who\nprocess is an integral part of the student’s schedule creation. It requires care,\nschedule that provides the highest level of academic rigor and offers the student\nan opportunity for success. After final approval, a student’s schedule will not be\nAPRIL–MAY: o Course schedule approvals by student’s School Counselors o\nadjustments will be allowed o Creation of course schedule for each student by\nOffice of Academic Affairs o Schedule on-line release and access via On-Campus •\nSEPTEMBER: o Limited review and realignment of student schedules by OAA to\na drop/add period o On-line publication and posting of student’s schedule to\nFindmyschedule.net ***Course placement is dependent on course availability and\nAcademic Study Hall - Guidelines & Schedule\nASH each Tuesday & Thursday per the schedule below • Gold Group – students who\nas well as every other Saturday per the schedule below • Attendance will be recorded\nat each ASH session The upcoming schedule for Tues & Thurs ASH this year will be:\n3/27 Thursday 3pm-4pm LHN The upcoming schedule for Saturday ASH this year\nASYNC schedule\ntheir semester exams on the scheduled day unless illness prevents them from\nscheduled classes, La Salle students have an additional class added to their\nschedule in which they meet individually with their Learning Specialists. The class\nstudents will have adjustments in their individual schedules to properly schedule a full\ncourse schedule (See the course requirements for each class year to review potential\nschedule does not necessitate any special scheduling rules. LEADERSHIP",
  "calendar_info": "academic calendar year. • Students missing three hours or more of a day will be\nacademic calendar and the student’s instructional time. The general timeline for\nMAY-AUGUST o Course placement/selection is locked in the year and no course\nshould be scheduled to present the smallest interruption to the academic calendar\nthe Fine Arts Programs 5. May-August a. Creation of course schedule for each\nstudent by Office of Academic Affairs 6. Late August: a. Schedule on-line release and\nPROCEDURES Academic Calendar Each year, Calvert Hall establishes an academic\ncalendar which outlines the dates of academic instruction. In compliance with the Maryland\nState of Maryland. While the School builds additional days into the academic calendar to\nright to amend or modify the academic calendar as needed, including amending or modifying\nlaptop. The general loaner laptop fee is $5 per calendar day. In an effort to work with\nmid-August. Over the summer, take your time to read through the checklist and\nPage 21: Understand the Orientation Schedule in August n Decide if the\nClass Tradition Event n School Calendar/Handbook n Code of Conduct /\naccount with an FFCC representative on August 7th at 6:15. You can fnd a link\nlaptop. The loaner laptop fee is $5 per calendar day. The loaner fee is waived\nand completed by the frst cycle of classes in August. Section 6 17 Section 7\nInfo/Records System, Magnus Health, by August 1st, 2024. To log in to Magnus,\ncomplete this checklist by August 1st, 2024. Physicals: All students must\ncompleted between May 31st and August 1, 2024. Physicals dated prior to May\nthe Magnus Health System by August 1st. Students must submit a physical\nSchedule in August Contact: Mr. Marc Parisi, Director of Student Activities\nparisim@calverthall.com or 410-825-4266 ext 118 During the week of August\n19th through August 23rd, all incoming freshmen must participate in a\nof August 19-23, Marching Band Students will be participating in Marching\nAdventure Day on Wednesday, August 21 regardless of whether or not they are\non Friday, August 23. Non-Freshman Connection Full Marching Band (FMB)\nAugust 23. Freshman Orientation Adventure Day Each year, Calvert Hall\nsign up on Thursday, August 22. Each experience will involve learning about\nstudents in early August with information about signing permission slips\nelectronically. Freshman Orientation Day On Wednesday, August 28th the\nattend orientation on August 28th from 11:30AM until 5:00PM. Freshmen should\nstudents’ schedules, which will be sent home in late August. School dress\nstudents will report to CHC for their first day of school on Thursday, August 29.\nAdventure Day and Technology Boot Camp? Did you mark your calendarfor\nFreshman Orientation and the Parent Welcome Night on August 28th? day with\nperiod. Dismissal will occur at 2:20PM on Thursday, August 29 for all students.\neach school day from 8:00 a.m. – 3:00 p.m. The webstore will open on August\n11. The Cardinal Shop will be open on Tuesday, August 13 from 10:00 a.m. –\n2:00 p.m. and Thursday, August 15 from 2:00 p.m. until 6:00 p.m. for “Tax Free",
  "car_registration": "Notification/Expectations A review of your semester 1 report card has indicated\nbelieve that a caring community develops the interpersonal relationships that are\nrequired to electronically verify Progress Reports. SEMESTER REPORT CARD: At\nReport Card. The Semester Report Card in each subject represents the cumulative\nachievement on the semester exam. The first Semester Report Card is issued in\nJanuary and the second Semester Report Card is issued in June. Parents are\nSemester 1 Report Card. FINAL GRADE FOR THE YEAR: A student’s final grade for\nReport Cards except for single semester courses which must be passed\nconsider every semester of a student’s Calvert Hall career. In their calculation,\nStudent Council, Unmanned Aerial Vehicle, Executive Board, Theatre, and\nprocess is an integral part of the student’s schedule creation. It requires care,\nbe permanent for his entire Calvert Hall career. Students who wish to move up a\nenrolled in AP Level courses must register for and complete the official AP Exam\nbe registered with School Counseling. The student will then need to be\neach course. Students should read each course description carefully and consider\nPrinciples of Catholic Social Teaching, and how they are called to care for the poor\nParticular care is taken to relate course material for preparation for the SAT exams.\nmedical technologies, and the role of healthcare professionals. This course\nconcert groups. The group utilizes improvisation as a vehicle to push the\ncarving. Students are encouraged to develop their ideas uniquely and receive\ncarefully structured sculpture problems. Prerequisite: Successful completion of\nboth team and individual, to develop sports skills, muscular and cardiovascular\ncardiovascular fitness and basic aquatic skills. Various team and individual sports\nhealth care issues. Topics include: the health benefits of physical fitness, nutrition,\ngame or event. The program is more designed toward carryover values in hopes\napplication process, and analysis of potential career interests. During their final\nfor each course. Students should read each course description carefully and\nA review of your semester 1 report card has indicated you have failed a subject for\nand talents. ♦ We believe that a caring community develops the interpersonal\nCARD: At the end of each semester, the Office of Academic Affairs (OAA) issues a\nSemester Report Card. The Semester Report Card in each subject represents the\nachievement on the semester exam. The first Semester Report Card is issued in\nJanuary and the second Semester Report Card is issued in June. Parents are\nReport Card. FINAL GRADE FOR THE YEAR: A student’s final grade for a course is\ndetermined by taking the average of the grades on the two Semester Report Cards\nconsider every semester of a student’s Calvert Hall career. In their calculation,\nVehicle, Executive Board, Theatre, and Yearbook. One or more years of the service\nIt requires care, discussion, and commitment from the student, his parents, and the\nhis entire Calvert Hall career. Students who wish to move up a level in a subject will\ncourses must register for and complete the official AP Exam associated with the",
  "retreats": "requirements. • All seniors must complete the retreat requirement to graduate. • All\nSeries, participation in field trips, two overnight retreat experiences, and courses\ngrading to meet graduation requirements. All seniors must complete the retreat\nSpeaker Series, participation in field trips, two overnight retreat experiences, and\naction which bring spiritual, personal and academic goals to fruition. Diversity, Equity,\nSeries, participation in field trips, retreat experiences, and courses on both the junior and\nmust complete the retreat requirement to graduate. n All seniors must complete an English\nand reconciliation throughout their five week Lenten journey. Retreats: Calvert Hall believes\nthat retreats are an essential part of the growth and development of our students. Every\nstudent participates in a retreat during each of his four years at The Hall. The overnight\nfreshman retreat helps our newest students understand what it means to be a Lasallian by\nfocusing on the core values of faith, service, and community. Sophomore retreat focuses on\nsocial action, as each sophomore participates in a day of service. Junior retreat focuses on\nat the River Valley Ranch in Manchester, MD. The junior retreat is led by junior and senior\npeer ministers as well as the Campus Ministry team. The senior retreat is a three-day,\ntwo-night retreat at the River Valley Ranch. During this capstone retreat, students focus on\nRetreat: Class of 2028 n The Student Schedule n School Counseling\nfreshmen will receive a Calvert Hall Day Planner at orientation. RETREAT –\nCLASS OF 2028 FRESHMAN RETREAT Each year, the Campus Ministry Offce at\naccomplished through retreats, service opportunities, liturgies, charitable\ndrives, prayer services and other aspects fundamental to the faith and spiritual\nClass of 2028 will take part in their frst retreat. This retreat will be a great\nretreat. Over the course of the two days, freshmen will bond in peer-led small\nFreshman Retreat will take place on the Calvert Hall campus on Thursday at\n6:00 p.m. with dinner in the dining hall. This retreat is a mandatory experience,\nas participating in retreat each year at Calvert Hall is a graduation requirement.\nIn recognition of the value and importance of the retreat experience, no sports\npractices, games or activities will take place on campus during the retreat.\nHoliday. School and offces will be closed on Friday and retreat will end on\nFriday morning. There is no cost to the students for the retreat. Retreat will be\nRetreat Information",
  "week_ahead": "and school use. The in-house word processing application software is Microsoft\nuse CAD software and therefore it is highly recommended for students to utilize a\nwell and through the use of MakeMusic® computer software, both at school and at\nSuite software of Illustrator, Photoshop, and InDesign. In addition, you will learn\npersonal and school use. The in-house word processing application software is\nto the program. Engineering students will be expected to use CAD software and\nlecture/lab as well and through the use of MakeMusic® computer software, both at\nSuite software of Illustrator, Photoshop, and InDesign. In addition, you will learn how\n9/9/2019Pasco Scientific SPARKvue Software\nInstall or download software onto School computers from the internet, home, or by\nSchool-owned equipment; ● Deliberately disrupt or attempt to disrupt the software or\nweb browser • Run productivity suite and note taking software • Be Wi-Fi enabled •\nThe Week Ahead Archive\nTWA4.6\nTWA3.31\nTWA 3.24\nTWA 3.17\nTWA 3.10\nprohibited. n Install or download software onto School computers from the internet, home, or\nsoftware or hardware of the School network; n Be “friends” with, or otherwise directly\nbrowser, productivity suite and note taking software (Microsoft Office, PowerPoint, etc.), be\nproductivity suite and note taking software (Microsoft Offce, PowerPoint, etc.),",
  "student_handbook": "issuing of their progress report (March 28) Absence or Tardy Policy for Academic\na fraudulent act on the student’s part as outlined in the Student Handbook (pg 15).\nPolicy (see below) PLAGIARISM Plagiarism is a situation in which one leads a\ncrediting sources. ARTIFICIAL INTELLIGENCE POLICY INTRODUCTION: Aligned\npolicy provides guidelines for responsible AI use while maintaining academic\nlearning while reflecting these core values. UNIVERSAL APPLICATION: This policy\npolicy will address potential risks, such as data privacy concerns, bias in AI\nalign with our core beliefs, including the school’s Acceptable Use Policy (AUP),\nfor violations will follow the guidelines provided under Student Handbook\nsections; Academics – Academic Honesty, and Student Conduct and Discipline. •\nadhering to this policy, Calvert Hall aims to integrate AI in a manner that enriches\nnot necessitate any special scheduling rules. LEADERSHIP INSTITUTE: Any\ndemonstrate exemplary character by not having any record of discipline for a\nserious offense, such as those listed in the Discipline Policies section of the\nStudent Handbook and Regulations, having no more than one violation of a school\nThrough the Social Studies curriculum, courses weave together the disciplines of\nera in 1815. The course weaves together the disciplines of geography, history,\ncovered, considerable time is devoted to analysis of monetary and fiscal policy,\nproject within a discipline of deep personal interest to the scholar. Mentorship\nliterature, painting, music, sculpture, and architecture, and the discipline of\nnot as separate technical disciplines but as interrelated manifestations of human\n(March 28) Absence or Tardy Policy for Academic Study Hall: • Please note that\nAsync Policy for AY 24_25\nUpdated ASYNC Policy for AY 24-25. Please read and review when CHC is on an\nSociety. ARTIFICIAL INTELLIGENCE USAGE POLICY As a school, Calvert Hall\nacademic honesty and the Acceptable Use policy for Technology. This policy outlines\nto the school Academic Honesty policy as outlined in the Student Handbook (Page\nproper attribution/citation per course policy. 7 OVERVIEW OF GRADING ACADEMIC\nschedule does not necessitate any special scheduling rules. LEADERSHIP\ndemonstrate exemplary character by not having any record of discipline for a serious\noffense, such as those listed in the Discipline Policies section of the Student\ntogether the disciplines of geography, history, economics, political science,\nin 1815. The course weaves together the disciplines of geography, history,\nfiscal policy, the effects of the national debt, and international trade. Prerequisites:\nresearch-based project within a discipline of deep personal interest to the scholar.\nsculpture, and architecture, and the discipline of philosophy. The components of\ndisciplines but as interrelated manifestations of human creativity. As such,\nStudent Handbook (pg 20) • Certificates of Merit for academic subjects are awarded\nPolicy for Student Schedules & Lunch Periods\nprotocols can have this privilege revoked and are subject to the school’s Discipline",
  "ai_policy": "submitting as one’s own work. ♦ Violation of the school’s Artificial Intelligence\ncrediting sources. ARTIFICIAL INTELLIGENCE POLICY INTRODUCTION: Aligned\nSociety. ARTIFICIAL INTELLIGENCE USAGE POLICY As a school, Calvert Hall\nrole of Artificial Intelligence (AI) tools in student learning and within our educational\nteacher’s authorization. With the advancement of Artificial Intelligence (AI) tools within our",
  "contacts": "the Office of Academic Affairs. Email excuses will not be accepted. You should see\nMr. Fan in person if you need to be excused. • No Proxy contact – contact Mr Fan\ncompletion of an academically rigorous course of study but also the formation of a\nthe reporting instructor and contacted by the OAA. Any ensuing violation requires\nrequired to electronically verify Progress Reports. SEMESTER REPORT CARD: At\nexpected to verify electronically their receipt of the Progress Reports and\nto the holiday. Parents/guardians will need to call the Attendance Office to verify\ncurrent course teacher’s recommendation. Typically, students will not be allowed\nOver an academic year, a ½ Credit course typically meets less often than a 1 Credit\naccommodations, please contact the student’s school counselor. 17 COURSE\nand the call to morality and justice presented by the events of daily living.\nPrinciples of Catholic Social Teaching, and how they are called to care for the poor\npreparation for college statistics courses typically required in business, social and\nExaminations Board. This non-calculus-based statistics course is typically\nAdvanced Placement Calculus 2.5 Grade 11, 12 The focus is on what is typically\npurpose of cyber-attacks and how they evolve. The hands-on course calls for a\nHonors Physics Grades 11, 12 Honors Physics provides a mathematically rigorous\nbeneath the surface and recognize how humans are called to be protectors of this\nspecifically designed to prepare students for the AP Language and Composition\nworks in British literature. British literature is studied chronologically and parallels\nspecifically designed to prepare students for the A.P. exam while concentrating on\nconducted completely in Spanish. It is specifically designed to prepare the student\nthe student's interest in the richness of the Francophone world. The language lab\nartistic and technical -- of motion pictures. Students will critically analyze films\nhe has learned to maintain a physically active and enjoyable life. Final grades in\nthat the student will utilize what he has learned to maintain a physically active and\nwithin the Capstone Experience includes personal contact with professional\nexcused from ASH with prior approval by the Office of Academic Affairs. Email\nexcused. • No Proxy contact – contact Mr Fan yourself. Questions can be directed to\nacademically rigorous course of study but also the formation of a young man with\ncontacted by the OAA. Any ensuing violation requires the student, with his parents or\nor guardian is required to electronically verify Progress Reports. Day-to-day grade\nexpected to verify electronically their receipt of the Progress Reports and Semester 1\nParents/guardians will need to call the Attendance Office to verify the holiday.\nrecommendation. Typically, students will not be allowed to have level changes in\nCredit or 1 Credit. Over an academic year, a ½ Credit course typically meets less\nAffairs. For the steps to be considered for accommodations, please contact the\nown faith and the call to morality and justice presented by the events of daily living.\nCatholic Social Teaching, and how they are called to care for the poor and vulnerable\ncourses typically required in business, social and natural science, and health",
  "graduation_requirements": "Page 9-10 Graduation\nRequirements.................................................................................................Page 11\nRequirements .............................................................................. Page 18-19\nRequirements............................................................................Page 20-22 Junior\nCourses and Requirements....................................................................................Page\nRequirements....................................................................................Page 26-29 Religion\nHall community promotes a brotherhood that endures beyond graduation. ♦ We\nCalvert Hall’s course offerings and academic requirements. This Program of\nCalvert Hall College High School diploma should recognize not only the successful\nPROMOTION REQUIREMENTS: To be promoted to the next grade, students are\ncompletion of a class in which the student has completed all course requirements.\nrequirements. At the end of an academic year, students with fewer than three\nEarly or accelerated graduation is not available in the Calvert Hall Program of\nbelow F 0.0 – .99 A student who fails to complete the requirements for a course\n“Incomplete” by completing all course requirements as established by the teacher.\ngraduating seniors should see the Director of Student Affairs. 11 GRADUATION\nREQUIREMENTS: All students at Calvert Hall are required to complete a\nconflicts may allow for waiver of requirements in these departments*** • Seniors\ngraduation exercises but will not receive a diploma until all graduation\nrequirements are met. Up to two and a half credit failures may be made up in\nCalvert Hall Summer School (or an approved summer school). The Diploma will\ntwelfth grade in another school and will not receive a Calvert Hall Diploma. • All\nseniors must submit a complete English term paper for grading to meet graduation\nrequirements. • All seniors must complete the retreat requirement to graduate. • All\ngraduating Seniors must attend Graduation Rehearsal, Graduation Liturgy, and\nCommencement Exercises. Calvert Hall reserves the right to withhold its Diploma\nCalvert Hall student can earn a certificate in leadership at graduation by\naccept transferred credit. NDMU DUAL ENROLLMENT REQUIREMENTS • Dual\ngraduation and students are still expected to enroll in six full credit courses in the\nappropriate track for matriculation and graduation. o Course placement may\nDESCRIPTIONS AND REQUIREMENTS FOR FRESHMEN, SOPHOMORE, JUNIOR,\nof the course requirements. In general, all courses need a recommendation by the\nin future AP courses. 18 FRESHMEN YEAR - COURSES AND REQUIREMENTS\nREQUIREMENTS (Page 2 of 2) REQUIRED COURSES AP or Honors Prep A Prep B\nAND REQUIREMENTS (Page 1 of 3) Course placement for SOPHOMORE year is\nREQUIREMENTS (Page 2 of 3) REQUIRED COURSES AP or Honors Prep A Prep B\nFundamentals of Art 22 SOPHOMORE YEAR - COURSES AND REQUIREMENTS\nCOURSES AND REQUIREMENTS (Page 1 of 3) Course placement for JUNIOR year\nrequirements to senior year except for highly motivated students who wish to take\nYEAR - COURSES AND REQUIREMENTS (Page 2 of 3) REQUIRED COURSES AP or",
  "course_placement": "academic affairs, including course selection 4 GRADUATE PROFILE A Man of\nschedule a full course schedule. ACADEMIC SKILLS PROGRAM (ASP): The\nCourse selection Tile displays information about approved summer courses for\nSELECTION/PLACEMENT PROCESS AND TIMELINE The course placement\nchooses in the course placement process in spring Semester, is what the student\nstudent. The following timeline is a guide to the course placement process. All\ncourse placements are subject to final review and approval by the Office of\nAcademic Affairs. Course placements may be adjusted to accommodate the proper\nappropriate track for matriculation and graduation. o Course placement may\nAPRIL–MAY: o Course schedule approvals by student’s School Counselors o\nCourse placement of Fine Arts course for students in the Fine Arts Programs •\nMAY-AUGUST o Course placement/selection is locked in the year and no course\nadjustments will be allowed o Creation of course schedule for each student by\nFindmyschedule.net ***Course placement is dependent on course availability and\nplacement process can be found on the Course Placement Tile on the Resource\n(Page 1 of 2) Course Placement for Freshmen year is completed by the Office of\nAND REQUIREMENTS (Page 1 of 3) Course placement for SOPHOMORE year is\nPlease see the section on Course Placement Process (page 15) For SOPHOMORE\nArt Courses during the course selection process. • Pre-requisite for all Fine Arts\nCOURSES AND REQUIREMENTS (Page 1 of 3) Course placement for JUNIOR year\nPlease see the section on Course Placement Process (page 15) For JUNIOR year,\no have priority access to Fine Art Courses during the course selection process. o\nAND REQUIREMENTS (Page 1 of 4) Course placement for SENIOR year is based on\nPlease see the section on Course Placement Process (page 15) For SENIOR year,\nDirector. o have priority access to Fine Art Courses during the course selection\nhave priority access to courses in the Fine Arts during the course placement\nCHC academics including the course placement process, available courses for\nof 2) Course Placement for Freshmen year is completed by the Office of Academic\nof students from previous years to determine the appropriate course placements.\npriority access to Fine Art Courses during the course selection process. ***REFER\nCourse placement for SOPHOMORE year is based on the student’s performance\nchange (i.e.: Prep A to Honors, etc.). All course placements are proposed in\nArt Courses during the course selection process. o Pre-requisite for all Fine Arts\nCOURSES AND REQUIREMENTS (Page 1 of 3) Course placement for JUNIOR year\nduring the course selection process. o Pre-requisite for all Fine Arts Courses is\nto Honors, etc.). All course placements are proposed in consultation with the\no have priority access to Fine Art Courses during the course selection process. o\nCourses.......................................................................Page 13 Course Selection\naspects of academic affairs, including course selection. 4 GRADUATE PROFILE A\ncourse schedule (See the course requirements for each class year to review potential",
  "national_honor_society": "Page 12 National Honor Society-Selection\nstanding in the National Honor Society. Instances of Academic Violations can\ncentury. 13 NATIONAL HONOR SOCIETY - SELECTION CRITERIA Membership in\nCalvert Hall’s chapter of the National Honor Society is a privilege bestowed on\ncharacter, and leadership. Students who are interested in applying to the NHS will\nthe National Honor Society is a privilege bestowed on those students who\nleadership. Students who are interested in applying to the NHS will be required to go\nstudents meet with the NHS adviser at the beginning of the second semester to prepare their\nBassett Model United Nations / Mr. Shank National Honor Society / Mrs. Urban Newspaper /\nMakowski Science National Honor Society / Mr. Motsay Ski Club / Mr. Luczak Spanish Club /",
  "academic_integrity": "Men of Integrity. The mission statement reflects the following common beliefs held\ntradition. A Man of Integrity ♦ Makes sound ethical and moral decisions. ♦ Acts\nthe community. 5 ACADEMIC EXPECTATIONS The dignity and integrity of each\nstudents and faculty. Breaches of academic integrity by a student undermine an\nstudent responsibility and academic honesty. STUDENT RESPONSIBILITIES: • To\nwith the meaning of plagiarism, to learn how to properly cite sources used in\nAn academic honesty violation will result in a failing grade of a zero (0) for the\nacademic work. All academic honesty violations are reported to the Office of\nPrincipal (OAA). In addition to the policies enumerated above, academic honesty\nexpulsion. Additionally, academic honesty violations may affect eligibility or\nPolicy (see below) PLAGIARISM Plagiarism is a situation in which one leads a\nwhen it is not. Plagiarism includes, but is not limited to, the following behaviors: ♦\nwith our Lasallian values of forming men of intellect, faith, and integrity, Calvert\nintegrity and critical thinking skills. We affirm the importance of collaboration\nUPHOLDING SCHOOL BELIEFS AND INTEGRITY: • All AI usage at Calvert Hall will\nsections; Academics – Academic Honesty, and Student Conduct and Discipline. •\nStudent Responsibilities, Academic Violations and Plagiarism are detailed in the\nas Men of Intellect, Men of Faith, and Men of Integrity. The mission statement reflects\nA Man of Integrity ♦ Makes sound ethical and moral decisions. ♦ Acts with poise and\nACADEMIC EXPECTATIONS The dignity and integrity of each individual student are\nBreaches of academic integrity by a student undermine an environment of freedom\nCheating”) To acquaint themselves with the meaning of plagiarism, to learn how to\nPLAGIARISM Plagiarism is a situation in which one leads a reader to believe that\nwritten work submitted by the student is his own writing when it is not. Plagiarism\npresenting them as your own without crediting sources. An academic honesty\naddition to the policies enumerated above, academic honesty violations are subject\nacademic honesty violations may affect eligibility or standing in the National Honor\nacademic honesty and the Acceptable Use policy for Technology. This policy outlines\nviolation of academic honesty. Consequently, any AI related violation will be subject\nto the school Academic Honesty policy as outlined in the Student Handbook (Page\nof the material. Plagiarism in any form is strictly prohibited and includes the\nIntegrity. Philosophy Calvert Hall College is a Catholic and Lasallian school community\nIntegrity who promote justice in the world. Non-Discrimination Statement Calvert Hall does\nof the Calvert Hall experience and tradition. A Man of Integrity: 1. Makes sound ethical and\nan administrator of the other school. 14 ACADEMICS Academic Honesty Education begins\nand/or answers from a student who has already taken the test. Examples of plagiarism\nunauthorized or uncited is considered a violation of our policies. An academic honesty\nviolation will result in a failing grade on academic work of a zero. All academic honesty\nExpectations for Student Conduct Academic Integrity: The School has outlined its\nexpectations for academic integrity. Where a student’s behavior violates those expectations,",
  "fine_arts_programs": "Arts (Music, Visual Arts)..........................................................................................Page\nRequired*** Fine Arts: ½ Credit Required*** Physical Education/Health: 1 Credit\n(Fresh/Soph; JV; or Varsity), Band, CHC TV, Communications, Cyber Security,\nCourse placement of Fine Arts course for students in the Fine Arts Programs •\nPresentation Skills Freshmen year. • Students in a FINE ARTS PROGRAM (FA) o\nwill be placed in additional courses specified for their Fine Arts Program by their\n(Phys Ed I & Health and Comp Apps/Present Skills) with Basic Art (751) o Band\n& Health and Comp Apps/Present Skills) with Band (700), Fundamentals of\nInstrumental Music (any 710 course), and/or Jazz Ensemble (740), and/or Hallman\nChorus (730). o Have priority access to Fine Art Courses during the course\nSkills/Computer Apps REQUIRED COURSES FOR THE FINE ARTS PROGRAMS (All\ncourses are .5 credit unless otherwise noted) Band Courses • 700 Band - A, B, C (1\ncredit) Instrumental Courses • 710 Fundamentals of Instrumental Music • 740 Jazz\nEnsemble • 746 String Orchestra Choral Arts courses • 730 Hallman Chorus (1\ncredit) • 736 Vocal Ensemble • 737 Madrigal Ensemble • 741 Chamber Chorus\nVisual Arts Course • 751 Basic Art (1 credit) 20 SOPHOMORE YEAR - COURSES\n• All sophomore students are required to complete 0.5 credit in a Fine Arts course\ncredit. • in the Band or Art Program may DEFER their World Language requirement\nStudents in a FINE ARTS PROGRAM (FA): • will be placed in FA courses specified\nArt Courses during the course selection process. • Pre-requisite for all Fine Arts\nCourses is Department Approval. • who completed a year in the Band, Art or\nFine Arts Courses (These courses fulfill the 0.5 credit requirement for non-Fine Art\n• 718 Introduction of Music • 719 Basics of Piano • 720 Basics of Guitar • 725S Art\n(Page 3 of 3) REQUIRED COURSES FOR THE FINE ARTS PROGRAMS (All courses\nare .5 credit unless otherwise noted) Band Courses • 700 Band - A, B, C (1 credit) •\n711 Foundations of Music Theory • 712 Jazz Theory & Improvisation • 714 AP\nMusic Theory (1 credit) • 715 Music Composition/Arranging (1 credit) Instrumental\nCourses • 710 Fundamentals of Instrumental Music • 740 Jazz Ensemble • 742\nPercussion Ensemble Choral Arts courses • 730 Hallman Chorus (1 credit) • 732\nSolo Vocal Music • 736 Vocal Ensemble • 737 Madrigal Ensemble • 741 Chamber\nChorus Visual Arts Courses • 751 Basic Art (1 credit) • 761 Advanced Drawing and\nHumanities (901H) if they have not completed it Sophomore year. o In the Fine Arts\na seventh course. • Students in the FINE ARTS PROGRAM (FA): o will be placed in\nadditional courses specified for their Fine Arts Program by their Program Director.\nPre-requisite for all Fine Arts Courses is Department Approval ***REFER TO THE\nEnglish III REQUIRED COURSES FOR THE FINE ARTS PROGRAMS (All courses\nare .5 credit unless otherwise noted) Band Courses • 700 Band - A, B, C (1 credit) •\n711 Foundations of Music Theory (0.5 credit) • 712 Jazz Theory & Improvisation\n(0.5 credit) • 714 AP Music Theory (1 credit) • 715 Music Composition/Arranging (1\ncredit) Instrumental Courses • 710 Fundamentals of Instrumental Music (0.5 credit)",
  "leadership_programs": "thinking, and responsible leadership. Inspired by the faith and zeal of St. John\nresponsibility for his actions. ♦ Thinks independently. ♦ Provides leadership within\nleadership opportunities outside the traditional classroom setting. LA SALLE\nnot necessitate any special scheduling rules. LEADERSHIP INSTITUTE: Any\nCalvert Hall student can earn a certificate in leadership at graduation by\nincludes leadership seminars, attendance at the Leadership Dinner Speaker\nparticipation in clubs and activities as well as the completion of a Leadership\nPracticum experience that will put leadership skills into practice. STEM\ncharacter, and leadership. Students who are interested in applying to the NHS will\nyear. CHARACTER AND LEADERSHIP: A student must demonstrate positive\nleadership qualities in the classroom and in school activities. Candidates will be\nrequired to complete an essay on leadership. Also, candidates are required to\nLeadership Institute • 477 Leadership I (0.5 credit) 26 SENIOR YEAR - COURSES\nCommunications (0.5 credit) • 481 Business Management Leadership Institute •\n477II Leadership II (0.5 • credit) 29 SENIOR YEAR - COURSES AND\n======= 477I - Leadership I Grade 11 0.5 Credit The first semester of the course\nwill focus on “The Practical Leader.” Topics such as leadership styles,\nLeadership.” This semester will focus on different leaders throughout history and\nevaluate their leadership styles. What made them great? Where were they flawed?\nWhat can their leadership teach us about our own leadership? Prerequisite: Must\nbe a member of the Leadership Program 477II - Leadership II Grade 12 0.5 Credit\nLeadership II will put the practical leadership skills gained in Leadership I into\nperspective by looking at great models and figures of leadership throughout\nhistory. By exploring distinct leadership threads, this course will center around\nprofiles of leadership that challenged social norms and those in power, those who\nwere incredibly successful because of their leadership, and those whom history\nof Leadership I (477) and member of the Leadership Program 479 - Personal\ncredit) • 481 Business Managemen t Leadership Institute • 477 Leadership I (0.5\nCommunications (0.5 credit) • 481 Business Managemen t Leadership Institute •\n477II Leadership II (0.5 • credit) SENIOR YEAR - COURSES AND REQUIREMENTS\nleadership. Inspired by the faith and zeal of St. John Baptist de La Salle, our students\nactions. ♦ Thinks independently. ♦ Provides leadership within the community. 5\ncultural experiences and leadership opportunities outside the traditional classroom\nschedule does not necessitate any special scheduling rules. LEADERSHIP\nINSTITUTE: Any Calvert Hall student can earn a certificate in leadership at\nprogram that includes leadership seminars, attendance at the Leadership Dinner\ninclude participation in clubs and activities as well as the completion of a Leadership\nPracticum experience that will put leadership skills into practice. STEM PROGRAM:\nleadership. Students who are interested in applying to the NHS will be required to go\nor junior year. CHARACTER AND LEADERSHIP: A student must demonstrate",
  "stem_program": "Marking System ...............................................................................................................\nScience .............................................................................................................Page\n38-39 Science\n40-43 Engineering\nIntegrates technology for innovative problem solving. ♦ Embraces the quest for\nTechnology Committee. 7 POSITIVE AND NEGATIVE ASPECTS: • Positive Uses: AI\nalgorithms, and over-reliance on technology. Clear guidelines will be established\nto mitigate these risks, including regular audits and monitoring of AI systems.\nimpact assessments, and student surveys on technology dependence.\nQuestions and concerns can be submitted to the Director of Technology, a\nStudy. 9 MARKING SYSTEM Numerical Range Letter Grade G.P.A. (4.0 Scale) 96 –\nReligion: 4 Credits Required Mathematics: 3 Credits Required Laboratory Science:\nPracticum experience that will put leadership skills into practice. STEM\nand activities, the STEM Program is designed to encourage students as they\nactivities outside of the classroom in the practical application of STEM in the 21st\nMath Science Social Studies English World Language • Students will be placed by\n224 Geometry • 234 Algebra II Science 1 credit required • 305 H. Biology • 312\nfollowing subjects: Religion Math Science Social Studies English World Language\nand not in place of a required course. • Students enrolled in the Engineering\nrequirement. • who are enrolled in Intro to Engineering (270) – WAIVE their PE II &\nScience 1 credit required • 335 H. Chemistry • 326 Chemistry • 327 Chemistry\nDepartment Prep A/Honors Engineering/Science • 270 Intro to Engineering\nComputer Science/Math • 271 Honors Computer Programming 23 JUNIOR YEAR -\nfollowing subjects: Religion Math Science Social Studies English Elective (1.0\nLanguage will need to begin their language requirement. o will defer their science\nAlgebra II • 243 Pre-Calculus Science 1 credit required • 344 H Physics • 345I AP\nEnvironmental Science • 341 Physics • 347 Marine Biology • 395 Forensic Science •\n343 Conceptual Physics • 395 Forensic Science Social Studies 1 credit required •\nSpanish III • 648 Spanish IV Math /Computer Science • 251 AP Statistics • 271\nScience • 277 Introduction to Computer Algorithms Science/Engineering • 351\nHonors Anatomy & Physiology • 270 Intro to Engineering • 272 Engineering II\nLanguage if needed. o should choose an elective from Math, Science, Business or\nScience • 245 H Pre-Calculus • 251 AP Statistics • 258 H Differential Equations &\n• 285 AP Computer Science • 241 Pre-Calculus • 250 Statistics • 275 Foundations of\nComputer Science • 277 Introduction to Computer Algorithms • 280 Cybersecurity\nEssentials • 243 Pre-Calculus • 280 Cybersecurity Essentials Science / Engineering\nPhysiology • 365 AP Biology • 380 AP Environmental Science • 272 Engineering II •\n273 Engineering III • 341 Physics • 347 Marine Biology • 368 Biomedical Science •\n395 Forensic Science • 343 Conceptual Physics • 347 Marine Biology • 368\nBiomedical Science Social Studies/ Business • 470 AP Psychology • 445 AP"
}